package 자바용어및연산정리;

public class 자바연산자정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		
		/* 대인 연산자와 산술 연산자
		 *  = --> 연산자 오른쪽에 있는 값을 왼쪽에 있는 변수에 대입한다  결합방향 <--
		 *  + -->  두 피연산자의 값을 더한다.   결합방향 -->
		 *  - --> 왼쪽의 피연산자 값에서 오른쪽 피연산자 값을 뺀다   결합방향 -->
		 *  * --> 두피연산자의 값을 곱한다   결합방향 -->
		 *  / --> 왼쪽의 피연산자 값을 오른쪽의 피연산자 값으로 나눈다.   	결합방향 -->
		 *  % --> 왼쪽의 피연산자	값을 오른쪽의 피연산자 값으로 나눴을 때 얻게되는 나머지를 반환한다. 	결합방향-->
		 *
		 */
			
		
		/* 복합 대입 연산자
		 * 	a = a + b --> a += b
		 *	a = a - b --> a -= b
		 *	a = a * b --> a *= b
		 *	a = a / b --> a /= b
		 *	a = a % b --> a %= b 
		 */
		
		
		/* 관계 연산
		 *  < = n1 이 n2보다 작은가 	결합방향 -->
		 *  > = n1 이  n2보다 큰가 		결합방향 -->
		 *  <=  = n1이  n2보다 같거나 작은가?	결합방향 -->
		 *  >=	= n1이 n2보다 같거나 큰가?		결합방향 -->
		 *  ==	= n1과 n2가 같은가?		결합방향 -->
		 *  !=  = n1과 n2가 다른가		결합방향 -->
		 *  
		 *  true 또는 false반환
		 */
		
		
		/* 논리 연산자
		 * && = a와 b모두 true이면 연산결과는 true(논리 and)		결합방향 -->
		 * || = a 와 b 둘중 하나라도 true이면 연산결과는 true (논리or)		결합방향 -->
		 * !  =  연산 결과는 a가 true이면 false,  a가 false이면 true (논리not)	결합방향 <--
		 */
		
		/* 부호 연산자
		 *  -부호 붙으면 부호 반대로 출력 
		 */
		
		
		
		/* 증가 및 감소 연산자
		 * ++(prefix) : 피연산자의 저장된 값을 1증가 	결합방향-->
		 * --(prefix) : 피연산자의 저장된 값을 1감소 	결합방향<--
		 *  피연산자 뒤에 ++ 붙으면 postfix // 다음문장으로 넘어가야반
		 */
		
		/* 
		 * 
		 */
		
		
	}
	

}
